Revit 2024 API
DirectContext3DDocumentUtils.IsADirectContext3DHandleInstance Method
 Checks whether the provided Element ID corresponds to a DirectContext3D handle instance element.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public static bool IsADirectContext3DHandleInstance(
	Document aDocument,
	ElementId elementId
)
Visual Basic
Public Shared Function IsADirectContext3DHandleInstance ( _
	aDocument As Document, _
	elementId As ElementId _
) As Boolean
Visual C++
public:
static bool IsADirectContext3DHandleInstance(
	Document^ aDocument,
	ElementId^ elementId
)
Parameters
aDocument
Type: Autodesk.Revit.DB.Document
 The document.
elementId
Type: Autodesk.Revit.DB.ElementId
 The ID of the element to check.
Return Value
 True, if the element is a valid DirectContext3D handle instance, false otherwise.
Remarks
DirectContext3D handle instances are DirectShapes.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  aDocument is not a project document. -or- elementId is not a valid Element identifier.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectContext3DDocumentUtils Class
Autodesk.Revit.DB.DirectContext3D Namespace